Tekla Open API Reference for Tekla Structures 2025
RebarSplice.RebarSpliceTypeEnum Enumeration
 The splice types.
 Namespace: Tekla.Structures.Model
 Assembly: Tekla.Structures.Model (in Tekla.Structures.Model.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public enum RebarSpliceTypeEnum
Public Enumeration RebarSpliceTypeEnum
Members
Member name | Value | Description
SPLICE_TYPE_LAP_RIGHT | 0 |  The first (left) bar extends over the second (right) bar.
SPLICE_TYPE_LAP_LEFT | 1 |  The second (right) bar extends over the first (left) bar.
SPLICE_TYPE_LAP_BOTH | 2 |  Both bars extend over each other.
SPLICE_TYPE_MUFF | 3 |  The bar ends are joined with a muff.
SPLICE_TYPE_WELD | 4 |  The bar ends are joined with a weld.
See Also
Reference
Tekla.Structures.Model Namespace